fuelTable = { -- [ID мащины] = {виды топлива через запятую}, -99 дизель
	[562] = {92, 95, 98},
	[411] = {98},
	[429] = {98},
	[502] = {95, 98},
	[489] = {92, 95},
	[401] = {95, 98},
	[492] = {92, 95},
	[506] = {95, 98},
	[589] = {95, 98},
	[429] = {98},
	[558] = {98},
	[527] = {98},
	[542] = {92, 95},
	[507] = {92, 95},
	[551] = {92, 95},
	[559] = {98},
	[415] = {98},
	[410] = {99},
	[541] = {98},
	[604] = {92, 95},
}

function getCarFuelType (id)
if not tonumber (id) then return end
local fuel = fuelTable[id] or false
if fuel then
	return fuel
end
end