-- ["Автосалон"] = {x,y,z,x2,y2,z2,rx,ry,rz}, 
-- где x,y,z это позиция маркера 
-- и x2,y2,z2,rx,ry,rz это позиция спауна автомобиля при покупке.

vehShopsTable = 
{
	["Luxury Car"] = {1041.72180, 2369.00854, 10.05230, 1056.86072, 2385.88574, 11, 0, 0, -90},
	["Sport Car"] = {-1656.68982, 1211.11499, 6.25000, -1651.10791, 1220.38379, 7, 0, 0, 252},
	["Lada"] = {2131.79028, -1150.63586, 23.1353, 2121.80396, -1132.37610, 26, 0, 0, 0},
	--["Donate"] = {2493.67773, -1674.89734, 13.35336, 2505.55469, -1686.07849, 13.55218, 0, 0, 0},
}

markers = {
{-1594.931640625,658.5107421875,7.1},
}

vehShopVehicles = 
	{
	["Luxury Car"] = {
		{421,"Lexus LX570", 150000},
		{507,"Porsche Panamera ", 150000},
		{585,"BMW 750", 88000},
		{466,"BMW E34", 5500},
		{604,"Mitsubishi Lancer Evo VIII", 7000},
		{492,"BMW E60", 15000},
		{551,"BMW F10", 52000},
		{555,"BMW M3 E92", 52000},
		{542,"BMW M5 F90", 170000},
		{562,"BMW M2", 50000},
		{445,"Mersedes Benz E200", 35000},
		{561,"Ford Focus", 16000},
		{547,"Audi RS6", 150000},
		{458,"Mersedes Benz CLS63", 70000},
		{516,"Mersedes Benz E420", 8800},
		{579,"Mersedes Benz G65", 200000},
		{418,"Mersedes Benz S63 AMG", 170000},
		{546,"Mercedes Maybach S400", 130000},
		{543,"Nissan Silvia", 8800},
		{489,"Land Rover SVA", 200000},
		{566,"Lincoln Continental", 250000},
		{567,"Peugeot 406", 4400},
		{494,"Rolls Royce Wraith", 380000},
		{490,"Rolls Royce Phantom", 350000},
		{580,"Rolls-Royce Phantom 2018", 600000},
		{400,"Lamborghini Urus", 250000},
		{560,"Subaru Impreza", 10000},
		{404,"Toyota Land Cruiser", 120000},
		{505,"Volkswagen Touareg", 80000},
	},
	["Sport Car"] = {
		{415,"Koenigsegg Agera R", 1500000},
		{502,"Mersedes Benz AMG GT", 88000},
		{541,"Audi R8", 250000},
		{506,"Zenvo St1", 100000},
		{558,"Porsche 918", 1400000},
		{402,"Comaro ZL1", 35000},
		{503,"Chevrolet Corvette C7", 70000},
		{411,"Lamborghini Huracan", 260000},
		{429,"McLarean P1", 1400000},
		{589,"Porsche 911", 140000},
		{527,"Lamborghini Aventador", 1500000},
		{401,"Nissan GTR", 150000},
		{410,"BMW I8", 260000},
		{559,"Maserati Alfieri", 300000},
	},
	["Lada"] = {
		{405,"ВАЗ 2106", 1000},
		{438,"ВАЗ 2107", 1000},
		{479,"ВАЗ 2114", 3500},
		{491,"ВАЗ 2112", 2500},
		{540,"ВАЗ 2170", 4500},
		{419,"ВАЗ 2109", 3000},
	},
	["Donate"] = {
	}
}

vehShopColors = -- Цвета на выбор в салоне.
{
	{255,255,255},
	{0,0,0},
	{128,128,128},
	{255,0,0},
	{255,0,255},
	{255,255,0},
	{50,205,50},
	{0,0,255},
	{128,128,0},
	{32,178,170},
	{255,165,0},
	{128,0,128},
	{75,0,130},
}

testDriveSpawnPosition = {-468.36276245117,592.77911376953,18,90} -- Позиция начала тест-драйвов

vehShopWheels = {1073,1074,1075,1076,1077,1078,1079,1080,1081} -- ID дисков

numberSwitchPrice = 1000 -- Цена установки номера

tradeMarkerPositions = -- Позиции маркеров трейда
{
	{-1582.4191894531,658.60638427734,6.6441149711609},
}



defaultHandlingTable = -- Здесь просто паста из стандартного handling editor'а
{
	[559] = "JESTER 1500 3600 0 0 0 -0.5 75 0.84 0.87 0.44 5 305 15 80 r p 10 0.4 false 35 1.1 0.1 0 0.28 -0.05 0.5 0.3 0.25 0.6 35000 C0222804 4004400 1 1 1",
	[589] = "CLUB 1400 3000 0 0 0 -0.5 80 0.9 0.9 0.44 5 330 12 10 4 p 11 0.45 false 30 1.7 0.1 0 0.28 -0.01 0.4 0 0.25 0.5 35000 2000 1C04003 1 1 0",
	[415] = "CHEETAH 1200 3000 0 0 0 -0.5 70 0.8 0.9 0.44 5 420 12 30 r p 11.1 0.3 false 35 0.8 0.2 0 0.1 0.05 0.5 0.6 0.4 0.54 105000 C0220004 1004403 0 0 1",
	[401] = "BRAVURA 1200 3000 0 0 0 -0.5 70 0.8 0.9 0.44 5 320 12 70 4 p 11.1 0.3 false 35 0.8 0.2 0 0.1 -0.05 0.5 0.6 0.4 0.5 9000 C0220004 1000203 0 0 0",
	[585] = "EMPEROR 1800 4000 1 0 0 -0.4 75 0.9 0.8 0.43 5 305 8.4 50 r p 8 0.4 false 30 0.8 0.13 3 0.3 -0.2 0.5 0.3 0.2 0.56 35000 40222000 1400001 0 1 0",
	[492] = "GREENWOO 1600 4000 0 0 0 -0.45 70 0.9 0.8 0.4 5 250 12 150 r p 5.4 0.6 false 30 1 0.12 5 0.32 -0.1 0.45 0 0.22 0.54 19000 222000 11008801 0 3 0",
	[551] = "MERIT 1800 4500 0 0 0 -0.45 75 0.9 0.8 0.45 5 305 11 150 r p 9 0.4 false 30 1 0.15 0 0.27 -0.08 0.45 0.3 0.2 0.56 35000 40222000 1400003 0 1 0",
	--[] = "FELTZER 1575 3150 2.5 0 0 -0.2 70 0.85 0.85 0.5 5 354 50 120 4 p 7 0.45 false 45 1.6 0.12 1.3 0.32 -0.05 0.45 0.9 0.22 0.54 35000 2000 1008003 1 1 19",
	--[] = "FELTZER 1575 3150 2.5 0 0 -0.2 70 0.85 0.85 0.5 5 354 50 120 4 p 7 0.45 false 45 1.6 0.12 1.3 0.32 -0.05 0.45 0.9 0.22 0.54 35000 2000 1008003 1 1 19"
}

regions = {
{01, "Республика Адыгея"},
{02, "Республика Башкортостан"},
{03, "Республика Бурятия"},
{04, "Республика Алтай"},
{05, "Республика Дагестан"},
{06, "Республика Ингушетияг"},
{07, "Кабардино-Балкарская Республика"},
{08, "Республика Калмыкия"},
{09, "Республика Карачаево-Черкессия"},
{10, "Республика Карелия"},
{11, "Республика Коми"},
{12, "Республика Марий Эл"},
{13, "Республика Мордовия"},
{14, "Республика Саха (Якутия)"},
{15, "Республика Северная Осетия - Алания"},
{16, "Республика Татарстан"},
{17, "Республика Тыва"},
{18, "Удмуртская Республика"},
{19, "Республика Хакасия"},
{20, "Чеченская Республика"},
{21, "Чувашская Республика"},
{22, "Алтайский край"},
{23, "Краснодарский край"},
{24, "Красноярский край"},
{25, "Приморский край"},
{26, "Ставропольский край"},
{27, "Хабаровский край"},
{28, "Амурская область"},
{29, "Архангельская область"},
{30, "Астраханская область"},
{31, "Белгородская область"},
{32, "Брянская область"},
{33, "Владимирская область"},
{34, "Волгоградская область"},
{35, "Вологодская область"},
{36, "Воронежская область"},
{37, "Ивановская область"},
{38, "Иркутская область"},
{39, "Калининградская область"},
{40, "Калужская область"},
{41, "Камчатский край"},
{42, "Кемеровская область"},
{43, "Кировская область"},
{44, "Костромская область"},
{45, "Курганская область"},
{46, "Курская область"},
{47, "Ленинградская область"},
{48, "Липецкая область"},
{49, "Магаданская область"},
{50, "Московская область"},
{51, "Мурманская область"},
{52, "Нижегородская область"},
{53, "Новгородская область"},
{54, "Новосибирская область"},
{55, "Омская область"},
{56, "Оренбургская область"},
{57, "Орловская область"},
{58, "Пензенская область"},
{59, "Пермский край"},
{60, "Псковская область"},
{61, "Ростовская область"},
{62, "Рязанская область"},
{63, "Самарская область"},
{64, "Саратовская область"},
{65, "Сахалинская область"},
{66, "Свердловская область"},
{67, "Смоленская область"},
{68, "Тамбовская область"},
{69, "Тверская область"},
{70, "Томская область"},
{71, "Тульская область"},
{72, "Тюменская область"},
{73, "Ульяновская область"},
{74, "Челябинская область"},
{75, "Забайкальский край"},
{76, "Ярославская область"},
{77, "город Москва"},
{78, "город Санкт-Петербург"},
{79, "Еврейская автономная область"},
{80, "Забайкальский край"},
{81, "Пермский край"},
{82, "Автономная Республика Крым"},
{83, "Ненецкий автономный округ"},
{84, "Красноярский край"},
{85, "Иркутская область"},
{86, "Ханты-Мансийский автономный округ ЮГРА"},
{87, "Чукотский автономный округ"},
{88, "Красноярский край"},
{89, "Ямало-Ненецкий автономный округ"},
{90, "Московская область"},
{91, "Калининградская область"},
{92, "Севастополь"},
{93, "Краснодарский край"},
{94, "ШотоТамНеПонятное"},
{95, "Чеченская Республика"},
{96, "Свердловская область"},
{97, "город Москва"},
{98, "город Санкт-Петербург"},
{99, "город Москва"},
{102, "Республика Башкортостан"},
{113, "Республика Мордовия"},
{116, "Республика Татарстан"},
{121, "Республика Чувашия"},
{123, "Краснодарский край"},
{124, "Красноярский край"},
{125, "Приморский край"},
{134, "Волгоградская область"},
{136, "Воронежская область"},
{138, "Иркутская область"},
{142, "Кемеровская область"},
{150, "Московская область"},
{152, "Нижегородская область"},
{154, "Новосибирская область"},
{159, "Пермский край"},
{161, "Ростовская область"},
{163, "Самарская область"},
{164, "Саратовская область"},
{169, "Тверская область"},
{173, "Ульяновская область"},
{174, "Челябинская область"},
{177, "город Москва"},
{178, "город Санкт-Петербург"},
{186, "Ханты-Мансийский автономный округ ЮГРА"},
{190, "Московская область"},
{196, "Свердловская область"},
{197, "город Москва"},
{199, "город Москва"},
{716, "Республика Татарстан"},
{725, "Приморский край"},
{750, "Московская область"},
{777, "город Москва"},
{790, "Московская область"},
{797, "город Москва"},
}

function isDonateVehicle(id)
	for k,v in pairs(vehShopVehicles["Donate"]) do
		if id == v[1] then 
			return true
		end
	end
end

function getVehicleData(id)
	for key,val in pairs(vehShopVehicles) do
		for k,v in pairs(val) do
			if v[1] == tonumber(id) then
				return v
			end
		end
	end
end

function findVeh(id)
	local vehicles = getElementsByType("vehicle")
	for k,v in pairs(vehicles) do
		if getElementData(v,"ID") == id then
			return v
		end
	end
	return false
end

function convertNumber(amount)
	local formatted = amount
	while true do  
    formatted, k = string.gsub(formatted, "^(-?%d+)(%d%d%d)", '%1 %2')
    if (k==0) then
     	break
    end
  	end
	return formatted
end

function isPlayerOwner (player, veh)
local acc = getAccountName (getPlayerAccount(player))
if getElementData (veh, "owner") ~= false and getElementData (veh, "owner") == acc then
	return true
else
	return false
end
end