Banks = {
	{-1965.91028, 114.71237, 26.68750, ""}, -- позиция x,y,z для банка, маркера
	{1768.98352, -1885.24573, 12.55338, ""}, -- позиция x,y,z для банка, маркера
	{1436.80627, 2657.02271, 10.39261, ""}, -- позиция x,y,z для банка, маркера
	{752.58307, -1358.42261, 12.50000, ""},
}

createBlip (-1965.91028, 114.71237, 26.68750, 52, 1, 255, 255, 255, 255, 0, 500)
createBlip (1768.98352, -1885.24573, 12.55338, 52, 1, 255, 255, 255, 255, 0, 500)
createBlip (1436.80627, 2657.02271, 10.39261, 52, 1, 255, 255, 255, 255, 0, 500)

perchant = 1 -- процент начисления суммы от суммы в банке
minute = 120 -- через сколько времени после старта ресурса будет начисление процента от суммы в банке
maxTransfer = 50000000 -- максимально можно перевести в день